app/controllers/artists_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
def show
    @artists = Artist.find(params[:id])

INSERT INTO "artists" ("name", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Freddy Eduardo"], ["phone", 3001234569], ["created_at", "2018-10-01 22:44:08.243051"], ["updated_at", "2018-10-01 22:44:08.243051"]]
---
def create
    @artist = Artist.create(params.permit(:id, :name, :phone))

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "artists" SET "name" = ?, "phone" = ?, "updated_at" = ? WHERE "artists"."id" = ?  [["name", "Freddy Belmonte "], ["phone", 317320795], ["updated_at", "2018-09-25 22:17:18.058169"], ["id", 11]]
---
def update
    @artist = Artist.find(params[:id])
    @artist.update(artist_params)

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
DELETE FROM "artists" WHERE "artists"."id" = ?  [["id", 22]]
---
def destroy
    @artist = Artist.find(params[:id])
    @artist.destroy