app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
---
    def index
        @category = Category.all

INSERT INTO "categories" ("id", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["id", 1], ["category", "Teatro"], ["created_at", "2018-09-27 20:32:48.386380"], ["updated_at", "2018-09-27 20:32:48.386380"]]
---
      def create
          @category = Category.create(params.permit(:id, :category))