app/controllers/events_controller.rb

def index
        artist = Artist.find(params[:artist_id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

def todos
    @events = Event.all
---
SELECT "events".* FROM "events"

def category
    @category = Event.find(params[:category])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

def show
    # @artists = Artist.find(params[:id])
    events = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]

def create
    event = Event.create(params.permit(:artist_id, :event_name, :description, :date, :time, :avg_rating, :category, :latitude, :longitude))
---
INSERT INTO "events" ("event_name", "description", "date", "time", "avg_rating", "category", "latitude", "longitude", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

def update
    @events = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

def destroy
    @artist = Artist.find(params[:artist_id])
    @event = @artist.events.find(params[:id])
    @event.destroy
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."artist_id" = ? AND "events"."id" = ? LIMIT ?  [["artist_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 1]]